---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalService.VendorId
source: html/68781c7a-2932-eeb1-f483-e58fccec7c68.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalService.VendorId Property

The vendor who provided the service

## Syntax (C#)
```csharp
public string VendorId { get; }
```